In [1]:
import pandas as pd

In [10]:
data = pd.read_csv('MLDS/car-sales.csv')
data2 = pd.read_csv('MLDS/car-sales - Copy.csv')

In [12]:
data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [13]:
data2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [27]:
arr = data.index == data2.index
for i in arr:
    if i == False:
        raise Exception("Index not matched")

In [18]:
data.columns == data2.columns

array([ True,  True,  True,  True,  True])

In [29]:
arr2 =  data.values == data2.values

In [30]:
for j in arr2:

[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]
[ True  True  True  True  True]

In [4]:
lst = [1,2,3,4,5,6,7,8,9,10]
first = pd.DataFrame(lst)
first

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [4]:
lst2 = [{
    'name':'Light',
    'age':19,
},{
    'name':'kira',
    'age':19
},{
    'name':'L',
    'age':20
}]
two = pd.DataFrame(lst2)
two

    name  age
0  Light   19
1   kira   19
2      L   20

In [8]:
for i in two.values:
    print(i)

['Light' 19]
['kira' 19]
['L' 20]

In [1]:
import pandas as pd

In [2]:
l = [0,1,2]
ch = pd.DataFrame(l)

In [3]:
ch

   0
0  0
1  1
2  2

In [1]:
l = [[0]*4 for i in range(4)]
l

[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]

In [6]:
l2= [[0]*4]*4
l2

[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]